{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-command",
    "2": "I-command",
    "3": "B-equation",
    "4": "I-equation",
    "5": "B-expression",
    "6": "I-expression",
    "7": "B-term",
    "8": "I-term",
    "9": "B-command_attribute",
    "10": "I-command_attribute",
    "11": "B-method",
    "12": "I-method"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-command": 1,
    "B-command_attribute": 9,
    "B-equation": 3,
    "B-expression": 5,
    "B-method": 11,
    "B-term": 7,
    "I-command": 2,
    "I-command_attribute": 10,
    "I-equation": 4,
    "I-expression": 6,
    "I-method": 12,
    "I-term": 8,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "vocab_size": 30522
}
